Revit 2026 API

# BuiltInFailuresImportFailuresATFNonUniformScalingTransform Property

---

**Note: This API is now obsolete.**

The imported geometry contains non-uniform scaling transformations which Revit does not support. Some objects may be displaced or distorted.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedTransform instead.")]
public static FailureDefinitionId ATFNonUniformScalingTransform { get; }
```
```vb
<ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedTransform instead.")>
Public Shared ReadOnly Property ATFNonUniformScalingTransform As FailureDefinitionId
	Get
```
```cpp
public:
[ObsoleteAttribute(L"This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedTransform instead.")]
static property FailureDefinitionId^ ATFNonUniformScalingTransform {
	FailureDefinitionId^ get ();
}
```
```fsharp
[<ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedTransform instead.")>]
static member ATFNonUniformScalingTransform : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId

#### Reference

BuiltInFailuresImportFailures Class

Autodesk.Revit.DB Namespace